docs/assets/klotski.plantuml
@startuml

!include https://raw.githubusercontent.com/patrik-csak/one-dark-plantuml-theme/v1.0.1/theme.puml
top to bottom direction
skinparam linetype ortho

class BackToMainMenuClickListener {
  + BackToMainMenuClickListener(KlotskiGame):
  + clicked(InputEvent, float, float): void
}
class BigBlock {
  + BigBlock(Coordinate):
}
class Block {
  + Block(Coordinate, int, int, BlockType):
  + Block(Coordinate, int, int):
  - height: int
  - type: BlockType
  - width: int
  - location: Coordinate
  + occupiedSpaces(): List<Coordinate>
  - getBlockTypeBySize(Block): BlockType
  + hashCode(): int
  + toString(): String
  + getOccupiedLocations(Coordinate): List<Coordinate>
  + toJson(): String
  + fromJson(String): Block
  + clone(): Block
  + equals(Object): boolean
   location: Coordinate
   type: BlockType
   width: int
   height: int
   icon: String
   x: int
   y: int
   occupiedLocations: List<Coordinate>
}
enum BlockType << enumeration >> {
  + BlockType():
  + valueOf(String): BlockType
  + values(): BlockType[]
}
class Board {
  + Board(State, Skin):
  - itemWidth: float
  - state: State
  - itemHeight: float
  + loadBlocks(): void
  - moveBlock(Block, Direction): boolean
  + reset(): void
  + draw(Batch, float): void
  + playBestMove(): void
  + handleInput(): void
  - calculateSolution(): void
  + addTile(Block): void
  + undoMove(): void
  - calculateDragDirection(Vector2, Vector2): Direction
  - selectNextTile(): void
   state: State
   itemHeight: float
   itemWidth: float
}
class BoardPreview {
  + BoardPreview(Level, Skin):
  + draw(Batch, float): void
}
class ConfigurationMenuScreen {
  + ConfigurationMenuScreen(KlotskiGame):
  + pause(): void
  + resume(): void
  + render(float): void
  + dispose(): void
  + hide(): void
  - setupLayout(): void
  + resize(int, int): void
  + show(): void
}
class Coordinate {
  + Coordinate(int, int):
  - x: int
  - y: int
  + add(Coordinate): Coordinate
  + fromJson(String): Coordinate
  + of(int, int): Coordinate
  + add(int, int): Coordinate
  + hashCode(): int
  + move(Direction): Coordinate
  + equals(Object): boolean
  + toString(): String
  + clone(): Coordinate
  + toJson(): String
   x: int
   y: int
}
class DeleteSaveClickListener {
  + DeleteSaveClickListener(String, KlotskiGame):
  + clicked(InputEvent, float, float): void
}
enum Direction << enumeration >> {
  + Direction():
  + valueOf(String): Direction
  + values(): Direction[]
}
class GameOverScreen {
  + GameOverScreen(KlotskiGame, State):
  + dispose(): void
  + pause(): void
  + resize(int, int): void
  + hide(): void
  + show(): void
  - setupLayout(Skin): void
  + resume(): void
  + render(float): void
}
class GameScreen {
  + GameScreen(KlotskiGame, State):
  - setupSaveInput(): void
  + dispose(): void
  + resize(int, int): void
  + resume(): void
  + pause(): void
  - setupLayout(Skin): void
  + hide(): void
  + show(): void
  + render(float): void
}
class HorizontalBlock {
  + HorizontalBlock(Coordinate):
}
class KlotskiGame {
  + KlotskiGame():
  - camera: OrthographicCamera
  - debug: boolean
  - assetManager: AssetManager
  + buttonPressedPlay(): void
  + toggleDebug(): void
  + getStage(Viewport): Stage
  + create(): void
   effectsVolume: float
   background: Image
   camera: OrthographicCamera
   musicVolume: float
   assetManager: AssetManager
   debug: boolean
   skin: Skin
   imageButtonStyle: ImageButtonStyle
}
class KlotskiSolver {
  + KlotskiSolver(State):
  - pathToSolution: List<State>
  - getNextStates(int[]): List<int[]>
  - bfs(int, Queue<int[]>, int, Set<Long>, Map<int[], int[]>): int
  - reconstructPath(Map<int[], int[]>, int[]): List<State>
  - isOnLeftBorder(int): boolean
  - log2(int): int
  - getMirroredState(int[]): int[]
  - isValidBoard(int[]): boolean
  - isOnRightBorder(int): boolean
  + minSteps(): int
  - compress(int[]): Long
   pathToSolution: List<State>
}
class Level {
  + Level(String, Block[]):
  - board: Block[]
  - name: String
  + fromJson(String): List<Level>
  + toString(): String
  + toState(): State
   name: String
   board: Block[]
}
class LoadMenuScreen {
  + LoadMenuScreen(KlotskiGame):
  + resume(): void
  + hide(): void
  - createUI(ImageButtonStyle, Skin): void
  + dispose(): void
  + pause(): void
  + show(): void
  + render(float): void
  + resize(int, int): void
}
class Main {
  + Main():
  + main(String[]): void
}
class MainMenuScreen {
  + MainMenuScreen(KlotskiGame):
  + resume(): void
  + dispose(): void
  + show(): void
  + pause(): void
  - setupLayout(ImageButtonStyle, Skin): void
  + hide(): void
  + render(float): void
  + resize(int, int): void
}
class Resolution {
  + Resolution(int, int):
  - width: int
  - height: int
  - gcd(int, int): int
  + toString(): String
   width: int
   aspectRatio: String
   height: int
}
class SavesManager {
  + SavesManager(String):
  + SavesManager():
  - getSaveFilePath(String): String
  + loadStateByPath(String): State
  + loadLevels(String): List<Level>
  + deleteSave(String): void
  + loadStateByName(String): State
  - generateFilename(): String
  + saveState(State, String): void
  + loadLevelsFromDefaultPath(): List<Level>
  - createSaveDirectoryIfNotExists(): void
  + saveState(State): void
  + getMoves(String): int
   savedStatePaths: HashMap<String, Integer>
}
class SettingsScreen {
  + SettingsScreen(KlotskiGame):
  - setupLayout(Skin): void
  - makeBackButton(Table, Skin): void
  - makeEffectsVolumeSettings(Table, Skin): void
  - makeMusicVolumeSettings(Table, Skin): void
  + pause(): void
  + resume(): void
  + hide(): void
  + dispose(): void
  + render(float): void
  + resize(int, int): void
  + show(): void
  - makeResolutionSettings(Table, Skin): void
}
class SmallBlock {
  + SmallBlock(Coordinate):
}
class StartFromSaveClickListener {
  + StartFromSaveClickListener(String, KlotskiGame):
  + clicked(InputEvent, float, float): void
}
class State {
  - State():
  - blocks: HashMap<Coordinate, Block>
  - moves: int
  + fromJson(String): State
  + toBitBoard(): int[]
  + toString(): String
  + fromDefaultConfiguration(): State
  + createBlockFromBitMask(int): Block?
  + moveBlock(Block, Direction): boolean
  + toJson(): String
  + fromRandomConfiguration(): State
  - isValidBlock(Coordinate, int, int): boolean
  + fromBitBoard(int[]): State
  + equals(Object): boolean
  + clone(): State
  + createBitMaskForBlock(Block): int
  + isValidCoordinate(Coordinate): boolean
  + canMoveBlock(Block, Direction): boolean
   moves: int
   blocks: Block[]
   solved: boolean
}
class Tile {
  + Tile(float, float, float, float):
  - x: float
  - width: float
  - height: float
  - y: float
  - block: Block
  + contains(float, float): boolean
  + draw(Batch, float): void
   height: float
   color: Color
   width: float
   texture: Texture
   block: Block
   x: float
   y: float
   contourTexture: Texture
}
class VerticalBlock {
  + VerticalBlock(Coordinate):
}

BackToMainMenuClickListener "1" *-[#595959,plain]-> "game\n1" KlotskiGame
BackToMainMenuClickListener  -[#595959,dashed]->  MainMenuScreen              : "«create»"
BigBlock                     -[#000082,plain]-^  Block
Block                       "1" *-[#595959,plain]-> "type\n1" BlockType
Block                       "1" *-[#595959,plain]-> "location\n1" Coordinate
BlockType                    +-[#820000,plain]-  Block
Board                        -[#595959,dashed]->  KlotskiSolver               : "«create»"
Board                       "1" *-[#595959,plain]-> "solution\n*" State
Board                       "1" *-[#595959,plain]-> "tiles\n*" Tile
Board                        -[#595959,dashed]->  Tile                        : "«create»"
BoardPreview                "1" *-[#595959,plain]-> "level\n1" Level
BoardPreview                "1" *-[#595959,plain]-> "state\n1" State
BoardPreview                "1" *-[#595959,plain]-> "tiles\n*" Tile
ConfigurationMenuScreen      -[#595959,dashed]->  BackToMainMenuClickListener : "«create»"
ConfigurationMenuScreen      -[#595959,dashed]->  BoardPreview                : "«create»"
ConfigurationMenuScreen      -[#595959,dashed]->  GameScreen                  : "«create»"
ConfigurationMenuScreen     "1" *-[#595959,plain]-> "game\n1" KlotskiGame
ConfigurationMenuScreen      -[#595959,dashed]->  SavesManager                : "«create»"
ConfigurationMenuScreen     "1" *-[#595959,plain]-> "savesManager\n1" SavesManager
DeleteSaveClickListener     "1" *-[#595959,plain]-> "game\n1" KlotskiGame
DeleteSaveClickListener      -[#595959,dashed]->  LoadMenuScreen              : "«create»"
DeleteSaveClickListener      -[#595959,dashed]->  SavesManager                : "«create»"
DeleteSaveClickListener     "1" *-[#595959,plain]-> "savesManager\n1" SavesManager
GameOverScreen               -[#595959,dashed]->  BackToMainMenuClickListener : "«create»"
GameOverScreen              "1" *-[#595959,plain]-> "game\n1" KlotskiGame
GameOverScreen              "1" *-[#595959,plain]-> "savesManager\n1" SavesManager
GameOverScreen               -[#595959,dashed]->  SavesManager                : "«create»"
GameOverScreen              "1" *-[#595959,plain]-> "state\n1" State
GameScreen                   -[#595959,dashed]->  BackToMainMenuClickListener : "«create»"
GameScreen                   -[#595959,dashed]->  Board                       : "«create»"
GameScreen                  "1" *-[#595959,plain]-> "grid\n1" Board
GameScreen                   -[#595959,dashed]->  GameOverScreen              : "«create»"
GameScreen                  "1" *-[#595959,plain]-> "game\n1" KlotskiGame
GameScreen                   -[#595959,dashed]->  MainMenuScreen              : "«create»"
GameScreen                   -[#595959,dashed]->  SavesManager                : "«create»"
GameScreen                  "1" *-[#595959,plain]-> "savesManager\n1" SavesManager
HorizontalBlock              -[#000082,plain]-^  Block
KlotskiGame                  -[#595959,dashed]->  MainMenuScreen              : "«create»"
KlotskiSolver                -[#595959,dashed]->  BigBlock                    : "«create»"
KlotskiSolver               "1" *-[#595959,plain]-> "pathToSolution\n*" State
Level                       "1" *-[#595959,plain]-> "board\n*" Block
LoadMenuScreen               -[#595959,dashed]->  BackToMainMenuClickListener : "«create»"
LoadMenuScreen               -[#595959,dashed]->  DeleteSaveClickListener     : "«create»"
LoadMenuScreen              "1" *-[#595959,plain]-> "game\n1" KlotskiGame
LoadMenuScreen              "1" *-[#595959,plain]-> "savesManager\n1" SavesManager
LoadMenuScreen               -[#595959,dashed]->  SavesManager                : "«create»"
LoadMenuScreen               -[#595959,dashed]->  StartFromSaveClickListener  : "«create»"
MainMenuScreen               -[#595959,dashed]->  ConfigurationMenuScreen     : "«create»"
MainMenuScreen               -[#595959,dashed]->  GameScreen                  : "«create»"
MainMenuScreen              "1" *-[#595959,plain]-> "game\n1" KlotskiGame
MainMenuScreen               -[#595959,dashed]->  LoadMenuScreen              : "«create»"
MainMenuScreen               -[#595959,dashed]->  SettingsScreen              : "«create»"
SettingsScreen               -[#595959,dashed]->  BackToMainMenuClickListener : "«create»"
SettingsScreen              "1" *-[#595959,plain]-> "game\n1" KlotskiGame
SettingsScreen               -[#595959,dashed]->  Resolution                  : "«create»"
SmallBlock                   -[#000082,plain]-^  Block
StartFromSaveClickListener   -[#595959,dashed]->  GameScreen                  : "«create»"
StartFromSaveClickListener  "1" *-[#595959,plain]-> "game\n1" KlotskiGame
StartFromSaveClickListener   -[#595959,dashed]->  SavesManager                : "«create»"
StartFromSaveClickListener  "1" *-[#595959,plain]-> "savesManager\n1" SavesManager
State                        -[#595959,dashed]->  BigBlock                    : "«create»"
State                       "1" *-[#595959,plain]-> "blocks\n*" Block
State                        -[#595959,dashed]->  Block                       : "«create»"
State                        -[#595959,dashed]->  Coordinate                  : "«create»"
State                       "1" *-[#595959,plain]-> "blocks\n*" Coordinate
State                        -[#595959,dashed]->  HorizontalBlock             : "«create»"
State                        -[#595959,dashed]->  SavesManager                : "«create»"
State                       "1" *-[#595959,plain]-> "savesManager\n1" SavesManager
State                        -[#595959,dashed]->  SmallBlock                  : "«create»"
State                        -[#595959,dashed]->  VerticalBlock               : "«create»"
Tile                        "1" *-[#595959,plain]-> "block\n1" Block
VerticalBlock                -[#000082,plain]-^  Block
@enduml
